const ChangelogData = {
    version: "v0.2",
    logs: [
        { version: "v0.2.4", date: "2026-04-22", changes: [
            "修改了UI风格，改动了一些建筑效果",
            "平衡性调整，建筑变得更强但是更贵"
        ]},
        { version: "v0.2.3", date: "2026-04-21", changes: [
            "增加了一些花哨且无用的新科技和新建筑",
        ]},
        { version: "v0.2.2", date: "2026-04-19", changes: [
            "增加了幸福度详情显示",
            "平衡性调整，游戏整体进度更快了",
            "修复已知bug"
        ]},
        { version: "v0.2.1", date: "2026-04-19", changes: [
            "增加详细乘数计算界面，修复永恒速度升级不影响产出的bug",
            "增加了未知的新bug"
        ]},
        { version: "v0.2", date: "2026-04-18", changes: [
            "增加军事相关科技建筑，增加晶体系统",
        ]},
        { version: "v0.1", date: "2026-04-18", changes: [
            "游戏初始版本发布",
            "包含建筑、科技、升级、政策、贸易、永恒系统",
        ]}
    ]
};