const ChangelogData = {
    version: "v0.2",
    logs: [
        { version: "v0.6.1", date: "2026-05-08", changes: [
            "增加新的重置",
            "修复已知bug，增加未知bug"
        ]},
        { version: "v0.6.0", date: "2026-05-06", changes: [
            "虽然改成6.0了，但其实也没更新什么东西"
        ]},
        { version: "v0.5.8", date: "2026-05-05", changes: [
            "改正一些bug"
        ]},
        { version: "v0.5.7", date: "2026-05-03", changes: [
            "增加了冰河时期剧情模式",
            "由于我希望优化代码架构，因此短期内内容可能不会有更新，木卫二是0.5版本最后一个星球。"
        ]},
        { version: "v0.5.6", date: "2026-05-02", changes: [
            "增加新的科技和建筑",
            "现在手动贸易会自动保证获取的资源或金不超出上限，防止浪费"
        ]},
        { version: "v0.5.5", date: "2026-05-01", changes: [
            "修复成就丢失的问题"
        ]},
        { version: "v0.5.4", date: "2026-04-30", changes: [
            "改进了贸易系统",
            "现在游戏应该支持后台运行和离线进度",
            "增加成就系统"
        ]},
        { version: "v0.5.3", date: "2026-04-29", changes: [
            "增加一些煤相关的科技和建筑，煤变得（稍微（^-^））不那么缺乏。",
            "增加离线收益机制。"
        ]},
        { version: "v0.5.2", date: "2026-04-29", changes: [
            "增加一个新科技和建筑",
        ]},
        { version: "v0.5.1", date: "2026-04-28", changes: [
            "增加了几个新的科技和建筑，删除了一些对新版作用极小的老版本残留升级和科技",
            "修复了杜威分类法将图书馆上限错误提升到了40而不是正确的20的bug，这虽然是一个“好”的bug但并不是我们期待的",
            "增加了深色模式"
        ]},
        { version: "v0.5.0", date: "2026-04-24", changes: [
            "优化了很多文本",
            "改进了资源不足时建筑的表现，现在建筑会自适应面对资源不足的情况而不是粗暴地关停。",
            "改进了太空时代的逻辑，增加了一个新的建筑。",
            "修复了已知bug"
        ]},
        { version: "v0.4.0", date: "2026-04-23", changes: [
            "改变了太空相关宜居度机制，现在它们和游戏《Evolve》是类似的。",
        ]},
        { version: "v0.3.0", date: "2026-04-22", changes: [
            "增加了人口机制！幸运的是人们不需要消耗任何食物，至少目前如此。",
        ]},
        { version: "v0.2.4", date: "2026-04-22", changes: [
            "修改了UI风格，改动了一些建筑效果",
            "平衡性调整，建筑变得更强但是更贵"
        ]},
        { version: "v0.2.3", date: "2026-04-21", changes: [
            "增加了一些花哨且无用的新科技和新建筑",
        ]},
        { version: "v0.2.2", date: "2026-04-19", changes: [
            "增加了幸福度详情显示",
            "平衡性调整，游戏整体进度更快了",
            "修复已知bug"
        ]},
        { version: "v0.2.1", date: "2026-04-19", changes: [
            "增加详细乘数计算界面，修复永恒速度升级不影响产出的bug",
            "增加了未知的新bug"
        ]},
        { version: "v0.2", date: "2026-04-18", changes: [
            "增加军事相关科技建筑，增加晶体系统",
        ]},
        { version: "v0.1", date: "2026-04-18", changes: [
            "游戏初始版本发布",
            "包含建筑、科技、升级、政策、贸易、永恒系统",
        ]}
    ]
};